<template>
	<view class="course">
		<Introduction></Introduction>
		<section class="Index-Page">
		  <s-tabs :effect="true" v-model="activeTab" @change="change" :nav-per-view="3">
		    <s-tab title="<span>简介</span>">

人们从进化之初就与功夫分不开，那中国功夫呢？中国功夫是中华民族最具民族特色的传统文化之一，但为什么十分少见中国功夫在世界比赛上出现真正的格斗呢？人们可能说，中国功夫是养生不是格斗，错，中国功夫兼具养生和格斗。下面来跟我一起理解中国功夫。
<image src="../../static/img/SingleCommodity1.png" mode=""></image>

最初的中国功夫是用来狩猎的，其目的是增加捕猎的成功率，就像虎豹拥有捕猎本领的本质一样。所以说，最初的功夫就是用来击杀目标的。


随着发展，出现氏族社会，不同的部落之间会发生冲突和战争，其各种战场上搏斗的经验也被传授下去，其目的是赢得胜利，打败敌对的一方。

春秋战国时期，武将的选拔也是有很大一部分程度是依靠武力值，即功夫的强弱来定的。目的是在战争中取得胜利，击杀或击败对方。


封建社会初期，有霸王项羽的传奇，其功夫是当时十分了得的一位霸主，虽然最后败给了刘邦，但是可以看出，刘邦也收罗了一大批武将来赢得那场楚汉之争。当时的功夫也是为了战争。


唐代实行武举制，对有武术中一技之长的人授予不同级别的荣誉称号，大力发展武术，目的就是强健唐朝的兵力，增加在战场上的杀伤力。


明清时期，民间也大力发展武术，并形成了不同的流派，也时常发生派别之间的斗争，各派对本家功夫的改进也是为了增加功夫的杀伤力。


无数例子可以证明中国功夫也是为了格斗，为了打败对方。但我并不否认中国功夫的养生效果，其实，中国功夫是格斗和养生并存的，现在大部分国人都受各种武打片，动作片的影响，认为中国功夫是一种神秘的东西，其实不然，中国功夫离不开人，也脱离不了自然的法则，格斗就是要求力量、速度、韧性高度协调。当今大部分人只注重中国功夫的柔，却忽视了其刚性。要想发扬中国功夫，就要兼顾刚柔并济，以刚带柔，以柔养刚。


查看原文 >>
产品建议及投诉请联系：shoujibaidu@baidu.com


			</s-tab>
		    <s-tab title="<span>目录</span>">
人们从进化之初就与功夫分不开，那中国功夫呢？中国功夫是中华民族最具民族特色的传统文化之一，但为什么十分少见中国功夫在世界比赛上出现真正的格斗呢？人们可能说，中国功夫是养生不是格斗，错，中国功夫兼具养生和格斗。下面来跟我一起理解中国功夫。
<image src="../../static/img/SingleCommodity1.png" mode=""></image>

最初的中国功夫是用来狩猎的，其目的是增加捕猎的成功率，就像虎豹拥有捕猎本领的本质一样。所以说，最初的功夫就是用来击杀目标的。


随着发展，出现氏族社会，不同的部落之间会发生冲突和战争，其各种战场上搏斗的经验也被传授下去，其目的是赢得胜利，打败敌对的一方。

春秋战国时期，武将的选拔也是有很大一部分程度是依靠武力值，即功夫的强弱来定的。目的是在战争中取得胜利，击杀或击败对方。


封建社会初期，有霸王项羽的传奇，其功夫是当时十分了得的一位霸主，虽然最后败给了刘邦，但是可以看出，刘邦也收罗了一大批武将来赢得那场楚汉之争。当时的功夫也是为了战争。


唐代实行武举制，对有武术中一技之长的人授予不同级别的荣誉称号，大力发展武术，目的就是强健唐朝的兵力，增加在战场上的杀伤力。


明清时期，民间也大力发展武术，并形成了不同的流派，也时常发生派别之间的斗争，各派对本家功夫的改进也是为了增加功夫的杀伤力。


无数例子可以证明中国功夫也是为了格斗，为了打败对方。但我并不否认中国功夫的养生效果，其实，中国功夫是格斗和养生并存的，现在大部分国人都受各种武打片，动作片的影响，认为中国功夫是一种神秘的东西，其实不然，中国功夫离不开人，也脱离不了自然的法则，格斗就是要求力量、速度、韧性高度协调。当今大部分人只注重中国功夫的柔，却忽视了其刚性。要想发扬中国功夫，就要兼顾刚柔并济，以刚带柔，以柔养刚。


查看原文 >>
产品建议及投诉请联系：shoujibaidu@baidu.com
			</s-tab>
		    <s-tab title="<span>评价</span>">
		人们从进化之初就与功夫分不开，那中国功夫呢？中国功夫是中华民族最具民族特色的传统文化之一，但为什么十分少见中国功夫在世界比赛上出现真正的格斗呢？人们可能说，中国功夫是养生不是格斗，错，中国功夫兼具养生和格斗。下面来跟我一起理解中国功夫。
		<image src="../../static/img/SingleCommodity1.png" mode=""></image>
		
		最初的中国功夫是用来狩猎的，其目的是增加捕猎的成功率，就像虎豹拥有捕猎本领的本质一样。所以说，最初的功夫就是用来击杀目标的。
		
		
		随着发展，出现氏族社会，不同的部落之间会发生冲突和战争，其各种战场上搏斗的经验也被传授下去，其目的是赢得胜利，打败敌对的一方。
		
		春秋战国时期，武将的选拔也是有很大一部分程度是依靠武力值，即功夫的强弱来定的。目的是在战争中取得胜利，击杀或击败对方。
		
		
		封建社会初期，有霸王项羽的传奇，其功夫是当时十分了得的一位霸主，虽然最后败给了刘邦，但是可以看出，刘邦也收罗了一大批武将来赢得那场楚汉之争。当时的功夫也是为了战争。
		
		
		唐代实行武举制，对有武术中一技之长的人授予不同级别的荣誉称号，大力发展武术，目的就是强健唐朝的兵力，增加在战场上的杀伤力。
		
		
		明清时期，民间也大力发展武术，并形成了不同的流派，也时常发生派别之间的斗争，各派对本家功夫的改进也是为了增加功夫的杀伤力。
		
		
		无数例子可以证明中国功夫也是为了格斗，为了打败对方。但我并不否认中国功夫的养生效果，其实，中国功夫是格斗和养生并存的，现在大部分国人都受各种武打片，动作片的影响，认为中国功夫是一种神秘的东西，其实不然，中国功夫离不开人，也脱离不了自然的法则，格斗就是要求力量、速度、韧性高度协调。当今大部分人只注重中国功夫的柔，却忽视了其刚性。要想发扬中国功夫，就要兼顾刚柔并济，以刚带柔，以柔养刚。
		
		
		查看原文 >>
		产品建议及投诉请联系：shoujibaidu@baidu.com	
			</s-tab>
		  </s-tabs>
		</section>
	</view>
</template>

<script>
	import Introduction from '@/components/course/Introduction.vue'
    import sTabs        from '@/components/s-ui/s-tabs/index.vue'
	import sTab         from '@/components/s-ui/s-tab/index.vue'
	

	export default {
		data() {
			return {
activeTab: 0
			}
		},
		components:{
			Introduction,
			sTabs,
			sTab

		},
		
		methods: {
    change (index) {
      console.log(index);
    }
		}
	}
</script>

<style>
</style>
